var chart1 = bb.generate({
  bindto: "#LineChart",
  data: {
    "x": "x",
    columns: [
      ["x", "2011", "2012", "2013", "2014", "2015", "2016"],
      ["남학생", 0.5, 0.7, 0.9, 0.9, 0.6, 0.7],
      ["여학생", 0.6, 0.8, 0.7, 0.6, 0.7, 0.7]
    ],
    "colors": {
      "남학생": "#C54460",
      "여학생": "#A4C03C"
    },
    "labels": true
  },
  "axis": {
    "x": {
      "label": "(년)"
    },
    "y": {
      "label": "(만원)"
    }
  },
});

bb.generate({
  bindto: "#StepChart",
  data: {
    "x": "x",
    columns: [
      ["x", "2011", "2012", "2013", "2014", "2015", "2016"],
      ["중학교", 12614,12614,12754,12012,11222,10657],
      ["고등학교", 15860,14921,14869,14278,14184,14981]
    ],
    types: {
      "중학교": "area-step",
      "고등학교": "area-step"
    },
    "colors": {
      "중학교": "#9137D0",
      "고등학교": "#3376D0"
    },
    "labels": true
  },
  "axis": {
    "x": {
      "label": "(년)"
    },
    "y": {
      "label": "(억원)"
    }
  },
});

var chart2 = bb.generate({
  "data": {
    "columns": [
      ["국어", 1.6],
      ["영어", 7.9],
      ["수학", 7.6],
      ["사회/과학", 1.0],
      ["제2외국어,컴퓨터", 0.3]
    ],
    "type": "donut",
    "colors": {
      "국어": "#A4C03C",
      "영어": "#C54460",
      "수학": "#EFA351",
      "사회/과학": "#377DD3",
      "제2외국어,컴퓨터": "#8E38D0"
    }
  },
  "donut": {
    "title": "과목별 월평균 사교육비"
  },
  "bindto": "#DonutChart"
});

bb.generate({
  "data": {
    "columns": [
      ["방과 후 학교", 1.6,	1.9, 1.9,	1.9,	1.3,	1.4,	1.0],
      ["EBS 교재비", 0.2,	0.3,	0.2,	0.3,	0.2,	0.2,	0.2],
      ["어학연수비", 0.5,	0.7,	0.7,	0.6,	0.5,	0.4,	0.6]
    ],
    "colors": {
      "방과 후 학교": "#A4C03C",
      "EBS 교재비": "#EFA351",
      "어학연수비": "#8E38D0"
    },

    "type": "bar"
  },
  "axis": {
    "x": {
      "type": "category",
      "categories": [
        "평균", "대도시", "서울", "광역시", "대도시 외", "중소도시", "읍면지역"
      ]
    },
    "y": {
      "label": "(만원)"
    }
  },
  "bar": {
    "width": {
      "ratio": 0.5
    }
  },
  "bindto": "#BarChart"
});

var chart3 = bb.generate({
  "data": {
    "columns": [
      ["상위 10% 이내", 32.9],
      ["11~30%", 30.2]
    ],
    "type": "pie",
    "colors": {
      "상위 10% 이내": "#A4C03C",
      "11~30%": "#C54460",
      "31~60%": "#EFA351",
      "61~80%": "#8E38D0"
    }
  },
  "bindto": "#PieChart"
});

bb.generate({
  "data": {
    "x": "x",
    "columns": [
      ["x", "2011", "2012", "2013", "2014", "2015", "2016"],
      ["서울", 307, 316, 311,	 376, 349, 313],
      ["부산", 48	, 128, 264, 215, 199, 125],
      ["대구", 237, 239, 222, 229	, 206, 174],
      ['충남', 50	, 50, 195, 202, 197, 17]
    ],
    "type": "bar",
    "colors": {
      "서울": "#A4C03C",
      "부산": "#EFA351",
      "대구": "#C54460",
      "충남": "#8E38D0"
    },
    "groups": [
      [
        "서울",
        "부산",
        "대구",
        "충남"
      ]
    ],
    "labels": true
  },
  "axis": {
    "x": {
      "label": "(년)"
    },
    "y": {
      "label": "(개)"
    }
  },
  "bindto": "#StackedBarChart"
});

bb.generate({
  "data": {
    "columns": [
      //["x","30세 미만","30~35세 미만","35~40세 미만","40~45세 미만","45~50세 미만","50세 이상"]
      ["응답자수",207,2524,2158,1516,1079,1769],
      ["비율",2.2,27.3,23.3,16.4,11.7,19.1]
    ],
    "axes": {
      "응답자수": "y",
      "비율": "y2"
    },
    "types": {
      "응답자수": "bar"
    },
    "colors": {
      "응답자수": "#377DD3",
      "비율": "#EFA351"
    },
    "labels": true
  },
  "axis": {
    "x": {
      "type": "category",
      "categories": [
        "30세 미만","30~35세 미만","35~40세 미만","40~45세 미만","45~50세 미만","50세 이상"
      ]
    },
    "y": {
      "label": "(명)",
      "tick": {
        "values": [400,800,1200,1600,2000,2400,2800]
      }
    },
    "y2": {
      "show": true,
      "label": "(%)"
    },
    "rotated": true
  },
  "bindto": "#RotatedAxis"
});

bb.generate({
  "data": {
    "columns": [
      ["여성", 27.5, 18.0	, 16.6, 11.7, 26.2],
      ["남성", 9.0, 11.6, 12.8, 11.7, 54.9],
      ["소계", 15.3,	13.8, 14.1, 11.7, 45.1],
      ["수도권", 15.9	, 12.5, 13.0, 9.9, 48.6],
      ["비수도권", 14.6, 15.1, 15.3, 13.7, 41.3]
    ],
    "type": "bar",
    "colors": {
      "여성": "#A4C03C",
      "남성": "#EFA351",
      "수도권": "#C54460",
      "비수도권": "#377DD3",
      "소계": "#8E38D0"
    },
    "types": {
      "수도권": "spline",
      "비수도권": "line",
      "여성": "bar",
      "남성": "bar",
      "소계": "bar"
    },
    "groups": [
      [
        "여성",
        "남성"
      ]
    ]
  },
  "axis": {
    "x": {
      "type": "category",
      "categories": [
        "0~2000", "2~3000", "3~4000", "4~5000", "5000~"
      ],
      "label": "(만원)"
    },
    "y": {
      "label": "(%)"
    }
  },
  "bindto": "#CombinationChart"
});

var chart4 = bb.generate({
  "data": {
    "x": "x",
    "columns": [
      ["x", "2011", "2012", "2013", "2014", "2015", "2016"],
      ["여성", 262046, 204704, 235204, 226010, 252200, 248296]
    ],
    "types": {
      "여성": "area-spline",
      "남성": "area-spline"
    },
    "groups": [
      [
        "여성",
        "남성"
      ]
    ],
    "colors": {
      "여성": "#C54460",
      "남성": "#EFA351"
    }
  },
  "axis": {
    "x": {
      "label": "(년)"
    },
    "y": {
      "label": "(명)"
    }
  },
  "bindto": "#StackedAreaChart"
});

setTimeout(function () {
  chart1.load({
    columns: [
      ['평균', 0.5, 0.8, 0.8, 0.8, 0.6, 0.7]
    ]
  });
}, 1000);

setTimeout(function () {
  chart2.unload({
    ids: "제2외국어,컴퓨터"
  });
}, 2500);

setTimeout(function () {
  chart3.load({
    columns: [
      ["31~60%", 26.9],
      ["61~80%", 23.1]
    ]
  });
}, 2000);

setTimeout(function () {
  chart4.load({
    columns: [
      ["남성", 371720, 325496, 360522, 363160, 395421, 421211]
    ]
  });
}, 2000);